stevenj/avr-libc3/include/avr/io/attiny9.h
/******************************************************************************
 *   This file is part of avr-libc3.                                          * 
 *                                                                            * 
 *   Automatically created by devtools/gen-ioheader-atdf.py (V0.91)           * 
 *                                                                            * 
 *   .atpack File: ATtiny9.atdf                                               * 
 *   .ATDF File:   atdf/ATtiny9.atdf                                          * 
 *   Version:      2.0.10                                                     * 
 *   Date:         2019-04-25                                                 * 
 *   Device:       ATtiny9                                                    * 
 *   Architecture: AVR8L                                                      * 
 *                                                                            * 
 *   Changelog:                                                               * 
 *                                                                            * 
 *   2.0.10 2019-04-25 :                                                      * 
 *        - Added missing TCB1 PORTMUX for tiny3217/3216/1617/1616/1614.      * 
 *    2.0.2 2019-01-24 :                                                      * 
 *        - Corrected TC2 instance in ATtiny441.                              * 
 *        - Corrected defines for ATtiny1634.                                 * 
 *        - Refactored away family header files, now there is one header file * 
 *        - per device.                                                       * 
 *        - Corrected FUSE_MEMORY_SIZE for ATtiny4/5/9/10/20/40.              * 
 *        - Added simulator support for mega1609/1608/809/808.                * 
 *        - Succeeds Atmel.ATtiny_DFP 1.3.229.                                * 
 *                                                                            * 
 *   Generated Source Derived from data:                                      * 
 *   Copyright (c) 2019 Microchip Technology Inc.                             * 
 *                                                                            * 
 *   Licensed under the Apache License, Version 2.0 (the "License");          * 
 *   you may not use this file except in compliance with the License.         * 
 *   You may obtain a copy of the Licence at                                  * 
 *                                                                            * 
 *       http://www.apache.org/licenses/LICENSE-2.0                           * 
 *                                                                            * 
 *   Unless required by applicable law or agreed to in writing, software      * 
 *   distributed under the License is distributed on an "AS IS" BASIS,        * 
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. * 
 *   See the License for the specific language governing permissions and      * 
 *   limitations under the License.                                           * 
 ******************************************************************************/


#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "ioATtiny9.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#ifndef _AVR_ATtiny9_H_INCLUDED
#  define _AVR_ATtiny9_H_INCLUDED

/*
================================================================================
Ungrouped common register
================================================================================
*/

#define NVMCSR _SFR_MEM8 (0x32) /* Non-Volatile Memory Control and Status Register */
#define NVMCMD _SFR_MEM8 (0x33) /* Non-Volatile Memory Command */
#define VLMCSR _SFR_MEM8 (0x34) /* Vcc Level Monitoring Control and Status Register */
#define PRR    _SFR_MEM8 (0x35) /* Power Reduction Register */
#define CLKPSR _SFR_MEM8 (0x36) /* Clock Prescale Register */
#define CLKMSR _SFR_MEM8 (0x37) /* Clock Main Settings Register */

#define OSCCAL _SFR_MEM8 (0x39) /* Oscillator Calibration Value */
#define SMCR   _SFR_MEM8 (0x3A) /* Sleep Mode Control Register */
#define RSTFLR _SFR_MEM8 (0x3B) /* Reset Flag Register */
#define CCP    _SFR_MEM8 (0x3C) /* Configuration Change Protection */
#define SP     _SFR_MEM16(0x3D) /* Stack Pointer  */
#define SREG   _SFR_MEM8 (0x3F) /* Status Register */


/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

#if !defined (__ASSEMBLER__)
/*
================================================================================
IO Module Structures
================================================================================
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/

typedef struct FUSE_struct
{
    register8_t BYTE0;
} FUSE_t;


/* Output external clock */
typedef enum FUSE_CKOUT_enum
{
    FUSE_CKOUT_CLEAR_gc = (0x00), /* Output external clock - CLEAR */
    FUSE_CKOUT_SET_gc   = (0x04), /* Output external clock - SET */
} FUSE_CKOUT_t;

/* Watch dog timer always on */
typedef enum FUSE_WDTON_enum
{
    FUSE_WDTON_CLEAR_gc = (0x00), /* Watch dog timer always on - CLEAR */
    FUSE_WDTON_SET_gc   = (0x02), /* Watch dog timer always on - SET */
} FUSE_WDTON_t;

/* Disable external reset */
typedef enum FUSE_RSTDISBL_enum
{
    FUSE_RSTDISBL_CLEAR_gc = (0x00), /* Disable external reset - CLEAR */
    FUSE_RSTDISBL_SET_gc   = (0x01), /* Disable external reset - SET */
} FUSE_RSTDISBL_t;

/*
--------------------------------------------------------------------------------
LOCKBIT - Lockbits
--------------------------------------------------------------------------------
*/

