stevenj/avr-libc3/include/avr/io/attiny9.h
/* Watchdog Reset Flag */
typedef enum CPU_WDRF_enum
{
    CPU_WDRF_CLEAR_gc = (0x00), /* Watchdog Reset Flag - CLEAR */
    CPU_WDRF_SET_gc   = (0x08), /* Watchdog Reset Flag - SET */
} CPU_WDRF_t;

/* External Reset Flag */
typedef enum CPU_EXTRF_enum
{
    CPU_EXTRF_CLEAR_gc = (0x00), /* External Reset Flag - CLEAR */
    CPU_EXTRF_SET_gc   = (0x02), /* External Reset Flag - SET */
} CPU_EXTRF_t;

/* Power-on Reset Flag */
typedef enum CPU_PORF_enum
{
    CPU_PORF_CLEAR_gc = (0x00), /* Power-on Reset Flag - CLEAR */
    CPU_PORF_SET_gc   = (0x01), /* Power-on Reset Flag - SET */
} CPU_PORF_t;

/* Non-Volatile Memory Busy */
typedef enum CPU_NVMBSY_enum
{
    CPU_NVMBSY_CLEAR_gc = (0x00), /* Non-Volatile Memory Busy - CLEAR */
    CPU_NVMBSY_SET_gc   = (0x80), /* Non-Volatile Memory Busy - SET */
} CPU_NVMBSY_t;

/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTB_struct
{
    register8_t PINB;        /* Port B Data register */
    register8_t DDRB;        /* Data Direction Register, Port B */
    register8_t PORTB;       /* Input Pins, Port B */
    register8_t PUEB;        /* Pull-up Enable Control Register */
    register8_t rsv_0x04[8]; /* RESERVED REGISTER BLOCK */
    register8_t PORTCR;      /* Port Control Register */
} PORTB_t;


/* Break-Before-Make Mode Enable */
typedef enum PORTB_BBMB_enum
{
    PORTB_BBMB_CLEAR_gc = (0x00), /* Break-Before-Make Mode Enable - CLEAR */
    PORTB_BBMB_SET_gc   = (0x02), /* Break-Before-Make Mode Enable - SET */
} PORTB_BBMB_t;

/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/

typedef struct EXINT_struct
{
    register8_t rsv_0x00[16]; /* RESERVED REGISTER BLOCK */
    register8_t PCMSK;        /* Pin Change Mask Register */
    register8_t PCIFR;        /* Pin Change Interrupt Flag Register */
    register8_t PCICR;        /* Pin Change Interrupt Control Register */
    register8_t EIMSK;        /* External Interrupt Mask register */
    register8_t EIFR;         /* External Interrupt Flag register */
    register8_t EICRA;        /* External Interrupt Control Register A */
} EXINT_t;


/* Interrupt Sense Control 0 Bit 1 */
typedef enum EXINT_ISC01_enum
{
    EXINT_ISC01_CLEAR_gc = (0x00), /* Interrupt Sense Control 0 Bit 1 - CLEAR */
    EXINT_ISC01_SET_gc   = (0x02), /* Interrupt Sense Control 0 Bit 1 - SET */
} EXINT_ISC01_t;

/* Interrupt Sense Control 0 Bit 0 */
typedef enum EXINT_ISC00_enum
{
    EXINT_ISC00_CLEAR_gc = (0x00), /* Interrupt Sense Control 0 Bit 0 - CLEAR */
    EXINT_ISC00_SET_gc   = (0x01), /* Interrupt Sense Control 0 Bit 0 - SET */
} EXINT_ISC00_t;

/* External Interrupt Request 0 Enable */
typedef enum EXINT_INT0_enum
{
    EXINT_INT0_CLEAR_gc = (0x00), /* External Interrupt Request 0 Enable - CLEAR */
    EXINT_INT0_SET_gc   = (0x01), /* External Interrupt Request 0 Enable - SET */
} EXINT_INT0_t;

/* External Interrupt Flag 0 */
typedef enum EXINT_INTF0_enum
{
    EXINT_INTF0_CLEAR_gc = (0x00), /* External Interrupt Flag 0 - CLEAR */
    EXINT_INTF0_SET_gc   = (0x01), /* External Interrupt Flag 0 - SET */
} EXINT_INTF0_t;

/* Pin Change Interrupt Enable 0 */
typedef enum EXINT_PCIE0_enum
{
    EXINT_PCIE0_CLEAR_gc = (0x00), /* Pin Change Interrupt Enable 0 - CLEAR */
    EXINT_PCIE0_SET_gc   = (0x01), /* Pin Change Interrupt Enable 0 - SET */
} EXINT_PCIE0_t;

/* Pin Change Interrupt Flag 0 */
typedef enum EXINT_PCIF0_enum
{
    EXINT_PCIF0_CLEAR_gc = (0x00), /* Pin Change Interrupt Flag 0 - CLEAR */
    EXINT_PCIF0_SET_gc   = (0x01), /* Pin Change Interrupt Flag 0 - SET */
} EXINT_PCIF0_t;

/*
--------------------------------------------------------------------------------
TC16 - Timer/Counter, 16-bit
--------------------------------------------------------------------------------
*/

typedef struct TC0_struct
{
    register8_t rsv_0x00[34]; /* RESERVED REGISTER BLOCK */
    _REGISTER16 (ICR0);       /* Input Capture Register  Bytes */
    register8_t rsv_0x23;     /* RESERVED REGISTER */
    _REGISTER16 (OCR0B);      /* Timer/Counter0 Output Compare Register B  */
    register8_t rsv_0x25;     /* RESERVED REGISTER */
    _REGISTER16 (OCR0A);      /* Timer/Counter 0 Output Compare Register A  */
    register8_t rsv_0x27;     /* RESERVED REGISTER */
    _REGISTER16 (TCNT0);      /* Timer/Counter0  */
    register8_t rsv_0x29;     /* RESERVED REGISTER */
    register8_t TIFR0;        /* Overflow Interrupt Enable */
    register8_t TIMSK0;       /* Timer Interrupt Mask Register 0 */
    register8_t TCCR0C;       /* Timer/Counter 0 Control Register C */
    register8_t TCCR0B;       /* Timer/Counter 0 Control Register B */
    register8_t TCCR0A;       /* Timer/Counter 0 Control Register A */
    register8_t GTCCR;        /* General Timer/Counter Control Register */
} TC0_t;


/* Compare Output Mode for Channel A bits */
#define TC0_TCCR0A_COM0A_gc(x) ((x<<6) & 0xC0)

/* Compare Output Mode for Channel B bits */
#define TC0_TCCR0A_COM0B_gc(x) ((x<<4) & 0x30)

/* Waveform Generation Mode */
#define TC0_TCCR0A_WGM0_gc(x) (x & 0x03)

/* Input Capture Noise Canceler */
typedef enum TC0_ICNC0_enum
{
    TC0_ICNC0_CLEAR_gc = (0x00), /* Input Capture Noise Canceler - CLEAR */
    TC0_ICNC0_SET_gc   = (0x80), /* Input Capture Noise Canceler - SET */
} TC0_ICNC0_t;

/* Input Capture Edge Select */
typedef enum TC0_ICES0_enum
{
    TC0_ICES0_CLEAR_gc = (0x00), /* Input Capture Edge Select - CLEAR */
    TC0_ICES0_SET_gc   = (0x40), /* Input Capture Edge Select - SET */
} TC0_ICES0_t;

/* Waveform Generation Mode */
#define TC0_TCCR0B_WGM0_gc(x) ((x<<3) & 0x18)

/* Clock Select */
typedef enum TC0_CS0_enum
{
    TC0_CS0_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC0_CS0_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC0_CS0_VAL_0x02_gc = (0x02), /* Running, CLK/8 */
    TC0_CS0_VAL_0x03_gc = (0x03), /* Running, CLK/64 */
    TC0_CS0_VAL_0x04_gc = (0x04), /* Running, CLK/256 */
    TC0_CS0_VAL_0x05_gc = (0x05), /* Running, CLK/1024 */
    TC0_CS0_VAL_0x06_gc = (0x06), /* Running, ExtClk Tx Falling Edge */
    TC0_CS0_VAL_0x07_gc = (0x07), /* Running, ExtClk Tx Rising Edge */
} TC0_CS0_t;

/* Force Output Compare for Channel A */
typedef enum TC0_FOC0A_enum
{
    TC0_FOC0A_CLEAR_gc = (0x00), /* Force Output Compare for Channel A - CLEAR */
    TC0_FOC0A_SET_gc   = (0x80), /* Force Output Compare for Channel A - SET */
} TC0_FOC0A_t;

/* Force Output Compare for Channel B */
typedef enum TC0_FOC0B_enum
{
    TC0_FOC0B_CLEAR_gc = (0x00), /* Force Output Compare for Channel B - CLEAR */
    TC0_FOC0B_SET_gc   = (0x40), /* Force Output Compare for Channel B - SET */
} TC0_FOC0B_t;

/* Input Capture Interrupt Enable */
typedef enum TC0_ICIE0_enum
{
    TC0_ICIE0_CLEAR_gc = (0x00), /* Input Capture Interrupt Enable - CLEAR */
    TC0_ICIE0_SET_gc   = (0x20), /* Input Capture Interrupt Enable - SET */
} TC0_ICIE0_t;

/* Output Compare B Match Interrupt Enable */
typedef enum TC0_OCIE0B_enum
{
    TC0_OCIE0B_CLEAR_gc = (0x00), /* Output Compare B Match Interrupt Enable - CLEAR */
    TC0_OCIE0B_SET_gc   = (0x04), /* Output Compare B Match Interrupt Enable - SET */
} TC0_OCIE0B_t;

/* Output Compare A Match Interrupt Enable */
typedef enum TC0_OCIE0A_enum
{
    TC0_OCIE0A_CLEAR_gc = (0x00), /* Output Compare A Match Interrupt Enable - CLEAR */
    TC0_OCIE0A_SET_gc   = (0x02), /* Output Compare A Match Interrupt Enable - SET */
} TC0_OCIE0A_t;

