stevenj/avr-libc3/include/avr/io/attiny9.h
/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0000) /* Port B Data register */
#define PORTBB_DDRB     _SFR_MEM8 (0x0001) /* Data Direction Register, Port B */
#define PORTBB_PORTB    _SFR_MEM8 (0x0002) /* Input Pins, Port B */
#define PORTBB_PUEB     _SFR_MEM8 (0x0003) /* Pull-up Enable Control Register */
#define PORTBB_PORTCR   _SFR_MEM8 (0x000C) /* Port Control Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCMSK     _SFR_MEM8 (0x0010) /* Pin Change Mask Register */
#define EXINT_PCIFR     _SFR_MEM8 (0x0011) /* Pin Change Interrupt Flag Register */
#define EXINT_PCICR     _SFR_MEM8 (0x0012) /* Pin Change Interrupt Control Register */
#define EXINT_EIMSK     _SFR_MEM8 (0x0013) /* External Interrupt Mask register */
#define EXINT_EIFR      _SFR_MEM8 (0x0014) /* External Interrupt Flag register */
#define EXINT_EICRA     _SFR_MEM8 (0x0015) /* External Interrupt Control Register A */

/* TC0 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE       _SFR_MEM16(0x0000) /* TC16 Base Address */
#define TC16_ICR0       _SFR_MEM16(0x0022) /* Input Capture Register  Bytes */
#define TC16_ICR0L      _SFR_MEM8 (0x0022) /* Input Capture Register  Bytes LOW BYTE */
#define TC16_ICR0H      _SFR_MEM8 (0x0023) /* Input Capture Register  Bytes HIGH BYTE */
#define TC16_OCR0B      _SFR_MEM16(0x0024) /* Timer/Counter0 Output Compare Register B  */
#define TC16_OCR0BL     _SFR_MEM8 (0x0024) /* Timer/Counter0 Output Compare Register B  LOW BYTE */
#define TC16_OCR0BH     _SFR_MEM8 (0x0025) /* Timer/Counter0 Output Compare Register B  HIGH BYTE */
#define TC16_OCR0A      _SFR_MEM16(0x0026) /* Timer/Counter 0 Output Compare Register A  */
#define TC16_OCR0AL     _SFR_MEM8 (0x0026) /* Timer/Counter 0 Output Compare Register A  LOW BYTE */
#define TC16_OCR0AH     _SFR_MEM8 (0x0027) /* Timer/Counter 0 Output Compare Register A  HIGH BYTE */
#define TC16_TCNT0      _SFR_MEM16(0x0028) /* Timer/Counter0  */
#define TC16_TCNT0L     _SFR_MEM8 (0x0028) /* Timer/Counter0  LOW BYTE */
#define TC16_TCNT0H     _SFR_MEM8 (0x0029) /* Timer/Counter0  HIGH BYTE */
#define TC16_TIFR0      _SFR_MEM8 (0x002A) /* Overflow Interrupt Enable */
#define TC16_TIMSK0     _SFR_MEM8 (0x002B) /* Timer Interrupt Mask Register 0 */
#define TC16_TCCR0C     _SFR_MEM8 (0x002C) /* Timer/Counter 0 Control Register C */
#define TC16_TCCR0B     _SFR_MEM8 (0x002D) /* Timer/Counter 0 Control Register B */
#define TC16_TCCR0A     _SFR_MEM8 (0x002E) /* Timer/Counter 0 Control Register A */
#define TC16_GTCCR      _SFR_MEM8 (0x002F) /* General Timer/Counter Control Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR      _SFR_MEM8 (0x0031) /* Watchdog Timer Control and Status Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_BYTE0      _SFR_MEM8 (0x0000) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num      (0)                 
#define None_RESET_vect          _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num       (1)                 
#define None_INT0_vect           _VECTOR(1)          /* External Interrupt Request 0 */
#define None_PCINT0_vect_num     (2)                 
#define None_PCINT0_vect         _VECTOR(2)          /* Pin Change Interrupt Request 0 */
#define None_TIM0_CAPT_vect_num  (3)                 
#define None_TIM0_CAPT_vect      _VECTOR(3)          /* Timer/Counter0 Input Capture */
#define None_TIM0_OVF_vect_num   (4)                 
#define None_TIM0_OVF_vect       _VECTOR(4)          /* Timer/Counter0 Overflow */
#define None_TIM0_COMPA_vect_num (5)                 
#define None_TIM0_COMPA_vect     _VECTOR(5)          /* Timer/Counter Compare Match A */
#define None_TIM0_COMPB_vect_num (6)                 
#define None_TIM0_COMPB_vect     _VECTOR(6)          /* Timer/Counter Compare Match B */
#define None_ANA_COMP_vect_num   (7)                 
#define None_ANA_COMP_vect       _VECTOR(7)          /* Analog Comparator */
#define None_WDT_vect_num        (8)                 
#define None_WDT_vect            _VECTOR(8)          /* Watchdog Time-out */
#define None_VLM_vect_num        (9)                 
#define None_VLM_vect            _VECTOR(9)          /* Vcc Voltage Level Monitor */

/* Vector Table Size */
#define _VECTOR_SIZE             (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE            (10 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x0400)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

#define FLASH_START     (0x0000)                           
#define FLASH_SIZE      (0x0400)                           
#define FLASH_PAGE_SIZE (0x0080)                           
#define FLASH_END       (FLASH_START + FLASH_SIZE - 1)     

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0001)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

