stevenj/avr-libc3/include/avr/io/attiny9.h
#define FUSES_START     (0x0000)                             
#define FUSES_SIZE      (0x0001)                             
#define FUSES_PAGE_SIZE (0x0001)                             
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)       

#define LOCKBITSMEM_START  (0x0000)                                   
#define LOCKBITSMEM_SIZE   (0x0001)                                   
#define LOCKBITSMEM_END    (LOCKBITSMEM_START + LOCKBITSMEM_SIZE - 1) 

#define LOCKBITS_START     (0x0000)                                   
#define LOCKBITS_SIZE      (0x0001)                                   
#define LOCKBITS_PAGE_SIZE (0x0001)                                   
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)       

#define DATAMEM_START                       (0x0000)                                                               
#define DATAMEM_SIZE                        (0x4400)                                                               
#define DATAMEM_END                         (DATAMEM_START + DATAMEM_SIZE - 1)                                     

#define IO_START                            (0x0000)                                                               
#define IO_SIZE                             (0x0040)                                                               
#define IO_PAGE_SIZE                        (0x0001)                                                               
#define IO_END                              (IO_START + IO_SIZE - 1)                                               

#define SRAM_START                          (0x0040)                                                               
#define SRAM_SIZE                           (0x0020)                                                               
#define SRAM_PAGE_SIZE                      (0x0001)                                                               
#define SRAM_END                            (SRAM_START + SRAM_SIZE - 1)                                           

#define MAPPED_NVM_LOCK_BITS_START          (0x3F00)                                                               
#define MAPPED_NVM_LOCK_BITS_SIZE           (0x0002)                                                               
#define MAPPED_NVM_LOCK_BITS_PAGE_SIZE      (0x0001)                                                               
#define MAPPED_NVM_LOCK_BITS_END            (MAPPED_NVM_LOCK_BITS_START + MAPPED_NVM_LOCK_BITS_SIZE - 1)           

#define MAPPED_CONFIGURATION_BITS_START     (0x3F40)                                                               
#define MAPPED_CONFIGURATION_BITS_SIZE      (0x0002)                                                               
#define MAPPED_CONFIGURATION_BITS_PAGE_SIZE (0x0001)                                                               
#define MAPPED_CONFIGURATION_BITS_END       (MAPPED_CONFIGURATION_BITS_START + MAPPED_CONFIGURATION_BITS_SIZE - 1) 

#define MAPPED_CALIBRATION_BITS_START       (0x3F80)                                                               
#define MAPPED_CALIBRATION_BITS_SIZE        (0x0002)                                                               
#define MAPPED_CALIBRATION_BITS_PAGE_SIZE   (0x0001)                                                               
#define MAPPED_CALIBRATION_BITS_END         (MAPPED_CALIBRATION_BITS_START + MAPPED_CALIBRATION_BITS_SIZE - 1)     

#define MAPPED_DEVICE_ID_BITS_START         (0x3FC0)                                                               
#define MAPPED_DEVICE_ID_BITS_SIZE          (0x0004)                                                               
#define MAPPED_DEVICE_ID_BITS_PAGE_SIZE     (0x0001)                                                               
#define MAPPED_DEVICE_ID_BITS_END           (MAPPED_DEVICE_ID_BITS_START + MAPPED_DEVICE_ID_BITS_SIZE - 1)         

#define MAPPED_FLASH_START                  (0x4000)                                                               
#define MAPPED_FLASH_SIZE                   (0x0400)                                                               
#define MAPPED_FLASH_PAGE_SIZE              (0x0001)                                                               
#define MAPPED_FLASH_END                    (MAPPED_FLASH_START + MAPPED_FLASH_SIZE - 1)                           

/* ============ Port Bits ============ */


#define PB0 (0) 
#define PB1 (1) 
#define PB2 (2) 
#define PB3 (3) 

/*
================================================================================
Fuses/LockBits/Signatures
================================================================================
*/

/* ============ Fuses ============ */

#define FUSE_MEMORY_SIZE 0 

/* Fuse offset 0x00 */
#define RSTDISBL (unsigned char)~_BV(0) /* Disable external reset */
#define WDTON    (unsigned char)~_BV(1) /* Watch dog timer always on */
#define CKOUT    (unsigned char)~_BV(2) /* Output external clock */


/* ========== Lock Bits ========== */
#define __LOCK_BITS_EXIST  


/* ========== Signature ========== */
#define SIGNATURE_0 (0x1E) 
#define SIGNATURE_1 (0x90) 
#define SIGNATURE_2 (0x08) 

#endif /* #ifdef _AVR_ATtiny9_H_INCLUDED */
